package com.imamportal;


import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.text.method.ScrollingMovementMethod;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

public class ActivitySochorachorJiggsa extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_goponionitimala);
        TextView tvtext = findViewById(R.id.tvtext);
        TextView tvName = findViewById(R.id.tvName);
        tvName.setText(getString(R.string.sochorchorjiggasa));

        ImageView imgBack = (ImageView)findViewById(R.id.imgBack);
        imgBack.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
            }
        });

        tvtext.setMovementMethod(new ScrollingMovementMethod());

        tvtext.setText("ইমাম বাতায়ন কী?\n" +
                "\n" +
                "ইমাম বাতায়ন হচ্ছে ইমাম-মুয়াজ্জিনগণের জন্য এটুআই প্রোগ্রামের পরিকল্পনা ও তত্বাবধানে তৈরি একটি অনলাইন প্ল্যাটফর্ম। দেশের সকল ইমাম-মুয়াজ্জিনগণকে অনলাইনে একটি প্লাটফর্মে আনয়নের লক্ষ্যে এটুআই প্রোগ্রামের উদ্যোগে ‘ইমাম বাতায়ন’ তৈরি করা হয়েছে। এতে ইসলামিক জ্ঞানের সকল শাখা-প্রশাখা নিয়ে আলোচনা করার পাশাপাশি কারিগরি ও বৃত্তিমূলক প্রশিক্ষণের তথ্য প্রদান ও চাহিদা প্রেরণ করার ব্যবস্থা রাখা হয়েছে।\n" +
                "\n" +
                "\n" +
                "ইমাম বাতায়নের ঠিকানা/address কি?\n" +
                "\n" +
                "ইমাম বাতায়নের ঠিকানা হচ্ছে “ইমাম.বাংলা/ http://imam.gov.bd/”\n" +
                "\n" +
                "\n" +
                "ইমাম বাতায়ন তৈরির উদ্দেশ্য কী?\n" +
                "\n" +
                "ইমাম বাতায়নের মাধ্যমে ইমাম-মুয়াজ্জিনগণ পারস্পরিক যোগাযোগের পাশাপাশি নিয়মিত ব্লগিং, বিভিন্ন মাসলা-মাসায়েল ও ফতোয়া, সাপ্তাহিক খুতবা, সন্ত্রাস ও জঙিবাদ বিরোধী প্রচারণা, কিতাব, সাম্প্রতিক বিষয়াদিসহ দক্ষতা উন্নয়ন বিষয়ক কনটেন্ট শেয়ার করতে পারেন এবং প্রয়োজনে অন্যদের আপলোডকৃত কনটেন্ট পাঠের মাধ্যমে নিজের জ্ঞানের পরিধি বৃদ্ধি করতে পারবেন। এ পোর্টালের মাধ্যমে ইমাম-মুয়াজ্জিনগণ তাদের নিজ নিজ পেশার বাইরে কারিগরি ও বৃত্তিমূলক প্রশিক্ষণের তথ্য জানতে পারবেন ও বিভিন্ন ট্রেডে প্রশিক্ষণের জন্য অনলাইনে আবেদন করতে পারবেন। যার ফলে ইমাম-মুয়াজ্জিনগণ তাদের নিজ নিজ পেশার বাইরে যে কোন একটি কারিগরি বা বৃত্তিমূলক বিষয়ে প্রশিক্ষণ গ্রহণ করে তাদের আয় বাড়াতে সক্ষম হবেন। এর ফলে তাদের উপার্জন বৃদ্ধি পাওয়ার পাশাপাশি দেশের জাতীয় আয় বাড়বে।\n" +
                "\n" +
                "\n" +
                "এর মৌলিক উদ্দেশ্যগুলো হলো\n" +
                "\n" +
                "1. ইমাম-মুয়াজ্জিনগণের মধ্যে পারস্পরিক যোগাযোগ ও সহযোগিতা নিশ্চিতকরণ।\n" +
                "2. ইসলামিক বিষয়ের সঠিক ব্যাখ্যা প্রদান ও ইসলামের নামে চরমপন্থা প্রতিরোধ।\n" +
                "3. কারিগরি ও বৃত্তিমূলক প্রশিক্ষণ বিষয়ক তথ্য প্রদান ও চাহিদানুযায়ী ট্রেডে রেজিস্ট্রেশন করার সুযোগ।\n" +
                "\n" +
                "\n" +
                "ইমাম বাতায়ন কেন?\n" +
                "\n" +
                "আমরা জানি সমাজ পরিবর্তনের ক্ষেত্রে ইমাম-মুয়াজ্জিনগণের বড় ভূমিকা রয়েছে। তারা হচ্ছেন জনগণের অত্যন্ত কাছের লোক এবং সমাজে তাদের গ্রহণযোগ্যতা অনস্বীকার্য। দেশে ৩ লক্ষাধিক ইমাম-মুয়াজ্জিন রয়েছেন কিন্তু তারা সকলেই একে অপরের সাথে বিচ্ছিন্ন। যদি তাদেরকে একটি প্লাটফর্মে নিয়ে আসা যায় তাহলে তারা পরস্পর যোগাযোগের মাধ্যমে নলেজ শেয়ারিং করতে পারবেন। দেশের এক প্রান্ত থেকে একজন ইমাম বা মুয়াজ্জিন অপর প্রান্তের কোন বিজ্ঞ আলেমের নিকট থেকে ইসলামের সঠিক বিষয় সম্পর্কে খুব সহজেই জানতে পারবেন। সুতরাং ইমাম বাতায়ণের মাধ্যমে ইমাম-মুয়াজ্জিনগণের মধ্যে এক ধরণের পরিবর্তন হবে। এর ফলে ইমাম-মুয়াজ্জিনগণ আরও ভালোভাবে সমাজ পরিবর্তনে অংশ নিতে পারবেন। তাছাড়া সাধারণ জনগণ ‘ইমাম বাতায়ন’ থেকে দৈনন্দিন মাসআলা-মাসায়েলসহ ইসলামের সঠিক বিষয় জানতে পারবেন এবং প্রয়োজনে প্রশ্ন করতে পারবেন।\n" +
                "\n" +
                "\n" +
                "এই বাতায়নে কি কি ধরণের কনটেন্ট শেয়ার করা যাবে?\n" +
                "\n" +
                "এতে ইসলামিক জ্ঞানের সকল শাখা-প্রশাখা নিয়ে লেখা, অডিও, ভিডিও আপলোড করার পাশাপাশি ব্যক্তিগত, পারিবারিক, সামাজিক সমস্যা ও সমাধান বিষয়ক কনটেন্ট প্রদান করা যাবে। এছাড়া কারিগরি ও বৃত্তিমূলক প্রশিক্ষণের প্রয়োজনীয়তা ও করণীয় সম্পর্কে তথ্য শেয়ার করা যাবে।\n" +
                "\n" +
                "\n" +
                "ইমাম বাতায়ন সম্পর্কে কোন মতামত থাকলে কি করবো?\n" +
                "\n" +
                "যেকোন ধরনের প্রশ্ন ও মতামতের জন্য ‘মতামত’ লিংকে গিয়ে আপনার নাম, ই-মেইল সহ প্রশ্ন বা মতামত দিতে পারবেন।\n" +
                "\n" +
                "\n" +
                "কে বা কারা এই বাতায়ন ব্যবহার করতে পারবে?\n" +
                "\n" +
                "মসজিদের ইমাম-মুয়াজ্জিন ও মসজিদ সংশ্লিষ্ট কর্মকর্তা-কর্মচারি এবং মাদরাসার শিক্ষক শিক্ষার্থীরা নিবন্ধনের মাধ্যমে ইমাম বাতায়ণ ব্যবহার ও কনটেন্ট আপলোড করতে পারবেন। এ ছাড়া বাংলাদেশ এবং বিশ্বের যে কোন দেশ হতে সকল শেণীর ব্যক্তিবর্গ কনটেন্ট আপলোড ব্যতীত তাদের প্রয়োজন অনুস্বারে এই পোর্টাল ব্যবহার করতে পারবেন।");
    }
}
