package com.imamportal;

import android.content.Context;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.text.method.ScrollingMovementMethod;
import android.view.View;
import android.widget.EditText;
import android.widget.ImageView;
import android.widget.TextView;

public class AlochitoContentActivity extends AppCompatActivity {

    Context context;
    private String name,password;
    private TextView tvContentTitle,tvContent;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.alochito_content_details);
        overridePendingTransition(R.anim.trans_left_in, R.anim.trans_left_out);
        context=this;
        initUi();
    }

    private void initUi() {

        ImageView imgBack = (ImageView)findViewById(R.id.imgBack);
         tvContent = (TextView)findViewById(R.id.tvContent);
         tvContentTitle = (TextView)findViewById(R.id.tvContentTitle);
        imgBack.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
            }
        });
        tvContent.setMovementMethod(new ScrollingMovementMethod());
        tvContent.setText("\n" +
                "তাবলীগের কাজই হলো ঈমানের দিকে ডাকা। ঈমানকে পাকাপোক্ত করা। নিজের ও অন্যের একত্ববাদে বিশ্বাসকে দৃঢ় করা। তাই ঈমানের জন্য জরুরি হলো, এক দিকে যেমন তাওহীদের স্বীকৃতি দিতে হবে অন্য দিকে সব ধরনের শিরকের বিষয়ে নারাজীর ঘোষণাও দিতে হবে। কারো হৃদয়ে ঈমানের সাথে শিরকের সহাবস্থান সম্ভব নয়। তাইফের লোকেরা, যারা নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে নির্মমভাবে নির্যাতন করে ফিরিয়ে দিয়েছিল তারা পরে নিজেদের ভুল বুঝতে পেরে নবীজী সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের কাছে এসে বললো, হে রাসূল! আমরা তো ঈমান আনতে চাই তবে একটা শর্ত, বহু দিন থেকে দেবী মূর্তিগুলোর বিশেষ করে লাত দেবীর পূজা করে আসছি হঠাৎ করে তা ছেড়ে দিই কী করে? আমাদের তিন বছর সময় দিন আল্লাহরও ইবাদত করবো এবং লাতেরও পূজা দিব, ক্রমে মূর্তি পূজা ছেড়ে দেবো। নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম পরিষ্কার না করে দিলেন। তারা দুই বছর পরে এক বছরের অবকাশ প্রার্থনা করলো। রাসূল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সে অবকাশ দিতেও অস্বীকৃতি জানালেন। শেষ পর্যন্ত তারা আরজ করলো অন্তত এক মাসের অবকাশ দিন। রাসূল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এক দিনের জন্য, এক মুহূর্তের জন্যও ছাড় দিতে সম্মত হলেন না। ঈমান আনতে হলে এই মুহূর্তেই মূর্তিপূজা ত্যাগ করতে হবে।   \n" +
                "\n" +
                "\n" +
                "তাওহীদ ও ইসলামের কালিমাই হলো এ কথার সাক্ষ্য দেয়া যে ‘লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকালাহ’ কোনো ইলাহ নেই আল্লাহ ছাড়া। তিনি এক, তাঁর কোনো শরীক নেই। শত বছরের এক কাট্টা কাফির মুশরিকও যদি মৃত্যুর আগ মুহূর্তেও দৃঢ়ভাবে আন্তরিকতার সাথে তাওহীদের সাক্ষী দেয় এবং শিরক থেকে নারাজী ঘোষণা করে, তবে সে জাহান্নামের কঠিন আযাব থেকে বেঁচে যাবে, জান্নাতের অনন্ত সুখ নেয়ামতের অধিকারী হয়ে যাবে।\n" +
                "\n" +
                "\n" +
                "আল্লাহর অস্তিত্ব ও তাঁর গুণাবলীর উপর, তাঁর যাত ও সিফাতের উপর ঈমানের সাথে সাথে অন্তরে দৃঢ়মূল করতে হবে তিনি সর্বক্ষেত্রে এক, কোনো ক্ষেত্রে তাঁর কোনো শরীক নেই। অনাদি অনন্ত অস্তিত্বেও তিনি একক, সিফাত ও গুণাবলীতেও তিনি একক। উলূহিয়্যাত ও মা’বুদ হওয়ার ক্ষেত্রেও কেউ তাঁর কোনো শরীক নেই, ইবাদতের মালিক তো একমাত্র তিনিই।\n" +
                "\n" +
                "\n" +
                "‘লা ইলাহা ইল্লাল্লাহ’ কোনো ইলাহ নেই আল্লাহ ছাড়া, কোনো মা’বূদ নেই আল্লাহ ছাড়া, কোনো আশ্রয় নেই আল্লাহ ছাড়া, কারো কোনো ক্ষমতা নেই আল্লাহ ছাড়া, আমাকে কেউ বাঁচাতে পারবে না আল্লাহ ছাড়া, আমাকে কেউ মারতেও পারবে না আল্লাহ ছাড়া, আমার মনো বাসনা কেউ পূরণ করতে পারবে না আল্লাহ ছাড়া, আমার ক্ষতি করতে পারবে না কেউ আল্লাহ ছাড়া, আমার উপকারও করতে পারবে না কেউ আল্লাহ ছাড়া, ইজ্জতের মালিক কেউ নেই তিনি ছাড়া, বেইজ্জতও কেউ করতে পারবে না তিনি ছাড়া, তিনি যার উপকার করতে চান কেউ তার কণামাত্র ক্ষতি করতে পারবে না, আর তিনি যদি কারো ক্ষতি করতে ইরাদা করেন তবে কেউ নেই যে তার উপকার করতে পারবে বিন্দুমাত্র। রিয্ক ও জীবিকা তাঁরই হাতে। এই আকাশ যদি তামা হয়ে যায় আর জমিন যদি পাথর হয়ে যায়, এক ফোঁটা বৃষ্টিও যদি আকাশ থেকে না পড়ে আর একটা দানাও যদি জমিন থেকে উদগত না হয় তবুও তিনি তাঁর কুদরতে সকল মাখলুককে তার সৃষ্টিকে আহার যুগিয়ে বাঁচিয়ে রাখার ক্ষমতা ধারণ করেন।\n" +
                "\n" +
                "\n" +
                "সব সৃষ্টি স্বীয় অস্তিত্বে, বর্ধনে, হেফাজতে, বেঁচে থাকা, সুস্থ থাকা সব ক্ষেত্রেই তাঁরই ইচ্ছা অনিচ্ছার মুখাপেক্ষী। তিনি কোনো ক্ষেত্রে কারো মুখাপেক্ষী নন। পীর ফকীর ওলী দরবেশ কারো কোনো নিজস্ব ক্ষমতা নেই। এমন কি নবী রাসূলগণও ততটুকুই পারেন যতটুকু আল্লাহ পাক তাঁদের দিয়েছেন। যেহেতু সব ক্ষমতার মালিক তিনিই, তাই যা চাওয়ার সবই চাইতে হবে তাঁরই কাছে। দুআ ও প্রার্থনা হবে একমাত্র তাঁরই। অন্য কারো মুখাপেক্ষী হওয়া তাওহীদের আকীদার পরিপন্থী।\n" +
                "\n" +
                "\n" +
                "বিধানদাতাও তিনি। সকল সৃষ্টির চলার পথও নির্ধারণ করে দিয়েছেন তিনিই। এই মানুষেরও জীবন পরিচালনার বিধিবিধান ঠিক করে দিয়েছেন তিনিই। তিনি সর্বশ্রোতা, সর্বদ্রষ্টা এবং সর্বজ্ঞ। তাঁর অগোচরে, তাঁর আওতার বাইরে কোনো কিছু হওয়ার, কোনো কিছু ঘটার কোনো জো নেই, কোনো উপায় নেই।\n" +
                "\n" +
                "\n" +
                "নিজের ঈমানকে তাজা করার জন্য অন্যকেও ঈমান তাজা করার প্রতি উৎসাহ, দাওয়াত ও আমন্ত্রণ জানাতে হবে। তাহলেও নিজের ঈমানও তাজা হবে। আল্লাহ তাআলা আমাদের তাওফিক দিন। আমীন।\n" +
                "লেখক : চেয়ারম্যান, বাংলাদেশ জমিয়তুল উলামা ও ঐতিহাসিক শোলাকিয়ার গ্র্যান্ড ইমাম");
    }



}
